[
  {
    "season": 1,
    "episode": 1,
    "episodeName": "Welcome to Margrave",
    "primeSummary": "Reacher is wrongly accused of murder while visiting the small town of Margrave, GA.",
    "summary": "At midnight, a man is shot dead just outside Margrave, Georgia. The following morning, Jack Reacher arrives on a Greyhound bus and walks into town, where police arrest him at a diner for the murder. They send him to the local jail with Paul Hubble, a banker who has falsely confessed to the murder. Spivey, a crooked guard, puts them in with the general population, where Reacher brutally foils an attempt on their lives. Hubble explains he confessed to cover for a criminal organization that would have otherwise killed him and his family. After being released, KJ Kliner, the son of local businessman Kliner, verbally threatens Reacher in the town. When he later returns to the police station, he is informed about a second killing by local detective Oscar Finlay and cop Roscoe Conlink. At the morgue, a discussion about both the recent murder and another one earlier in the week leads him to identify the first victim as his older brother, Joe Reacher.",
    "releaseDate": "2022-02-03",
    "episodeLength": 56,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0J277BIKJDP28XYGTV1HHYRH2T/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ALAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 1,
    "episode": 2,
    "episodeName": "First Dance",
    "primeSummary": "When more victims are discovered, Reacher attempts to get answers but is set up. Roscoe receives a threatening message.",
    "summary": "Reacher teams up with Finlay and Roscoe to investigate his brother's murder and the recent disappearance of Hubble following his release from custody. Soon, they discover the gruesome murder of Finlay's boss, Ed Morrison, and his wife at their home. Reacher deduces that someone killed him for not taking care of Hubble. The mayor, Grover Teale, himself dirty, takes over as police chief and orders Finlay to conduct a sham investigation into Morrison's death. Finlay's friend, FBI agent Picard, agrees to take Hubble's wife and children into unofficial protective custody. Reacher sets a meeting with Spivey but gets ambushed by two South American ex-soldiers, allowing Spivey to escape. Roscoe then takes Reacher to a bar, where they dance. While driving home, they discovered that the road was submerged, and they spent the night resting in the same motel room, where Reacher opens up about his past.",
    "releaseDate": "2022-02-03",
    "episodeLength": 55,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0M82NICSEICCJJGGCYR6Y0KXB0/ref=atv_dp_btf_el_prime_uhd_tv_wfb_t1ALAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 1,
    "episode": 3,
    "episodeName": "Spoonful",
    "primeSummary": "Reacher and Finlay’s investigation into the missing Spivey leads them into a confrontation with Kliner Sr. Roscoe learns unsettling news about Reacher.",
    "summary": "Roscoe returns home to find evidence of a break-in. At Reacher's urging, she gives him a gun. The group contacts Joe's colleague, Molly Beth Gordon, at the Secret Service, learning that Joe was in Margrave on a confidential assignment to investigate reports of large-scale counterfeiting. Reacher intimidates one of Kliner's lawyers for information on Jobling, a Kliner truck driver the company went to great pains to release from police custody. Meanwhile, Finlay checks Spivey's house for clues and gets beaten by police after they mistake him for a burglar. The two men then visit Kliner in person. Kliner claims he knows nothing and makes threats to drop the investigation. Reacher convinces Roscoe and Finlay to move out of their homes temporarily. While buying supplies, Kliner's son KJ approaches Roscoe and warns her that Reacher is a murderer. The ex-soldiers again ambush Reacher, but this time he kills them. He then finds Spivey's corpse in their car trunk with a gunshot to the head.",
    "releaseDate": "2022-02-03",
    "episodeLength": 49,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0GNM61Y8LZQNDLA0OJV8FMTJH1/ref=atv_dp_btf_el_prime_uhd_tv_wfb_t1ALAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 1,
    "episode": 4,
    "episodeName": "In a Tree",
    "primeSummary": "As the danger increases, Reacher and Roscoe grow closer and they make plans to meet with their contact from Homeland Security.",
    "summary": "After meeting with Finlay, Reacher takes Roscoe to help him dispose of the bodies. He also reveals the truth behind KJ's warning: while serving in Iraq, Reacher killed three civilian men who were sexually assaulting a group of young boys. After Reacher dumps the evidence at an Atlanta airport, he pays for a hotel room using counterfeit cash, where he and Roscoe have sex after she surprises him in the shower. The next day, they visit the home of a former Kliner employee and find empty air conditioner boxes that Reacher suspects were used to move the counterfeit cash. Picard gives them a lead on the motel Joe stayed at before his murder; Reacher finds a hidden note before more mercenaries jump Roscoe and him. Roscoe saves Reacher's life, and Reacher admits he put himself in danger to protect her. Molly Beth arrives in Atlanta with Joe's files on the case, but someone kills her and steals the files seconds before Reacher finds her.",
    "releaseDate": "2022-02-03",
    "episodeLength": 48,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0FLJIYZTHPALBXKV5ACFZVRIRP/ref=atv_dp_btf_el_prime_uhd_tv_wfb_t1ALAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 1,
    "episode": 5,
    "episodeName": "No Apologies",
    "primeSummary": "As the mystery deepens, Reacher teams up with an old colleague and Finlay makes a shocking discovery.",
    "summary": "Feeling guilty for Molly Beth's murder, Reacher takes out his frustration by attacking KJ after he vandalizes Roscoe's truck. Kliner declines to press charges. Roscoe learns that Teale has fired her for \"subpar\" police work. Desperate for new leads, Reacher finds a key and trunk left by Roscoe's deceased former boss, Gray, containing research that confirms Reacher's suspicions that Margrave is the heart of Kliner's counterfeiting operation, but with no useable evidence. Travelling to Memphis, Reacher meets with his old comrade, private investigator Frances Neagley, to find a hitman who may have been Joe's murderer. After Roscoe punches Teale upon learning that he murdered Gray, Finlay gets her out of town by having her replace Picard as the Hubble family's bodyguard. Reacher and Neagley survive an attempt on their lives by a desperate Memphis cop since someone threatened his family. Finlay breaks into Kliner's office only to find that someone has killed Kliner.",
    "releaseDate": "2022-02-03",
    "episodeLength": 51,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0JNPJ7Y4WRNBT6GAT2GI4TNQYF/ref=atv_dp_btf_el_prime_uhd_tv_wfb_t1ALAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 1,
    "episode": 6,
    "episodeName": "Papier",
    "primeSummary": "As the town is rocked by another murder, Reacher heads to New York and learns the truth about the illegal business in Margrave while Roscoe faces danger in the woods.",
    "summary": "Finlay and Reacher follow one of Kliner's trucks. Finlay tells Reacher the real reason he came to Margrave was not due to divorce but because his wife Sharon died after a long illness. After finding the truck empty, Reacher goes to New York City to meet with one of Joe's contacts, Professor Kate Castillo, having found that someone murdered another contact under the guise of being mugged. He determines that Kliner had been shipping counterfeit money to a client in Venezuela, using \"super bills\" made from the specialized paper used in printing dollars. Assassins find Roscoe and Hubble's family, but Roscoe dispatches both men in the woods. While waiting for Picard, Paul Hubble's wife Charlie shares the details of their involvement with Kliner, explaining that Kliner tricked Paul into laundering money and two gangsters forced him to watch them crucify a man to ensure his loyalty to Kliner. Reacher arranges for Castillo to get police protection and uses his necktie to strangle an assassin sent to kill her.",
    "releaseDate": "2022-02-03",
    "episodeLength": 50,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0H4W2OA5VRCYD2C8QQEI120SGY/ref=atv_dp_btf_el_prime_uhd_tv_wfb_t1ALAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 1,
    "episode": 7,
    "episodeName": "Reacher Said Nothing",
    "primeSummary": "Reacher springs a trap and then gets trapped himself.",
    "summary": "A hit squad murdered Officer Stevenson and his pregnant wife, seeking information about the Hubble family. Teale fires Finlay on a pretext the following morning. Reacher pretends to confide in the last Margrave officer, Baker (who Reacher believes is corrupt), sharing a fake plan to search Hubble's house. Finlay goes in person to inform Stevenson's parents of his death. The hit squad goes to Hubble's house, planning to kill Reacher, but he traps and kills them all, including Kliner's nephew, Dawson. Based on the gathered information, Reacher realizes Kliner was bleaching $1 bills to get the paper needed to print his money. He checks in with Roscoe, who shares his discovery with Picard. Reacher helps Finlay evade mercenaries who track him to his motel due to his visit to the Stevensons'. Reacher and Finlay return to Jobling's house, where someone has burned it down. They search Jobling's parents' house and find boxes of counterfeit bills. They arrange a meeting with Picard. However, when they arrive, Picard is waiting with KJ and Teale.",
    "releaseDate": "2022-02-03",
    "episodeLength": 43,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0GXWEK0EED43A0QQFEI3IQRM4S/ref=atv_dp_btf_el_prime_uhd_tv_wfb_t1ALAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 1,
    "episode": 8,
    "episodeName": "Pie",
    "primeSummary": "Reacher leads a rescue mission at the warehouse that ends in a showdown.",
    "summary": "KJ confesses to all the murders, having killed Joe and the others to protect the operation and his father when he tried to stop him, feeling he'd gone too far. KJ shows Reacher a live stream of a captive Roscoe. He sends him and Picard to find Hubble. Reacher tricks Picard into stopping to fix a flat tire and shoots him; Picard escapes. Reacher immediately finds Hubble, who reveals he was working with Joe and Jobling (who feared they would murder him for stealing counterfeit bills) to stop Kliner's operation. Baker tortures and beats Finlay at the precinct; Reacher rams the station with a truck and kills him. Neagley arrives, and Reacher gathers weapons before torching Kliner's factory with gasoline. Finlay crushes Picard to death in a hydraulic press, while Roscoe subdues and handcuffs Teale before shooting him when he goes for her gun. As the warehouse goes up in flames, Reacher douses KJ with flammable chemicals and kicks him into the fire, burning him alive. A flashback reveals how Reacher's mother died in Paris after a long illness, giving him his French grandfather's Croix de Guerre. Roscoe gives Reacher her number and says to call whenever he wants. She tells him she wants to rebuild Margrave; Reacher suggests she consider running for Mayor. Finlay decides to move back to Boston. After burying the medal where Joe died, Reacher quietly walks out of Margrave. He sticks out his thumb for a ride, continuing his journey.",
    "releaseDate": "2022-02-03",
    "episodeLength": 54,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0J50A861QNVEOX9CGXIHIJSK0H/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ALAAAAAA0wr0?autoplay=1&t=2977"
  },
  {
    "season": 2,
    "episode": 1,
    "episodeName": "ATM",
    "primeSummary": "Reacher and Neagley investigate the murder of a member of 110th, a group of Special investigators assembled by Reacher, only to realize the whole unit may be at risk.",
    "summary": "Somewhere in the Catskill Mountains, a man falls out of a helicopter to his death. The next day, Jack Reacher collects his pension check in Arkansas after he intervenes to stop an armed carjacker. He then notices that his ATM receipt has an embedded military emergency assistance code in the amounts. Reacher contacts his former teammate Frances Neagley, who confirms she planted it there to get his attention. The man dropped from the helicopter was Calvin Franz, another former member of Reacher's hand-picked Special Investigations Unit during his time in the Army. The two begin investigating the murder with the help of a third member, David O'Donnell. Reacher acquires a data drive hidden by Franz, which holds a list of numbers and a separate list of names starting with the initials A.M., suspected to be aliases. Neagley reveals that another member of the 110th Special Investigations Unit, Stan Lowery, died in a car accident two years before Franz's murder, leaving only seven living members of the 110th. The trio swear to avenge Franz by finding and punishing his killers themselves. They try to locate another member of the unit, Tony Swan, at his home; however, upon noticing that no one is answering the door, they break in to find the house empty and Swan's dog dead from dehydration. Reacher, seeing the pattern with Franz murdered and now Swan presumed dead, deduces that someone is targeting every living member of his unit with brutal efficiency.",
    "releaseDate": "2023-12-14",
    "episodeLength": 56,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0FIMMPWASW7MF5N1S3A92HS8HM/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ALAAAAAA0wr0?autoplay=1&t=3048"
  },
  {
    "season": 2,
    "episode": 2,
    "episodeName": "What Happens in Atlantic City",
    "primeSummary": "The investigation into Franz’s murder takes Reacher and the surviving members of his former Army unit to Atlantic City where the mystery deepens, danger awaits, and an old flame is rekindled.",
    "summary": "Reacher assaults a stranger following him, only to then identify him as NYPD Detective Guy Russo. Reacher, Neagley, and O'Donnell visited Atlantic City, where two teammates (Sanchez and Orozco) worked as security guards for the Neptune Casino. Along the way, they meet Karla Dixon, another member of the team and potential love interest for Reacher. They find a helpful ally in David Wright, the casino's Chief of Security. He comps the team a suite to stay in and helps them search for Sanchez and Orozco. Unfortunately, his police contacts confirm that both men were abducted, murdered, and dumped in the same region of the mountains as Franz. He confirms that none of the casinos are missing money, so the numbers on the list must mean something else. A later assassination attempt points them back to New York and a defense contracting company called New Age Technologies.",
    "releaseDate": "2023-12-14",
    "episodeLength": 50,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0HAVW7OPSH4848COKI6FVT953W/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ALAAAAAA0wr0?autoplay=1&t=2702"
  },
  {
    "season": 2,
    "episode": 3,
    "episodeName": "Picture Says a Thousand Words",
    "primeSummary": "After more of his friends fall victim, Reacher forges an uneasy alliance with a dogged detective, and their only clue in the case leads the 110th to a troubling discovery.",
    "summary": "Flashbacks show New Age head of security Shane Langston torturing Franz for information. Before being thrown from the helicopter, Franz warns Langston that the \"big guy\" is coming for him. In the present, Reacher acquires guns for the team before Russo arrests O'Donnell and him. Russo reveals that his investigations have identified a suspect in the murders: Azari Mahmoud, the owner of the \"A.M.\" aliases, a terrorist broker wanted by the Department of Homeland Security. Meanwhile Neagley and Dixon visit the offices of New Age Technologies, where Director of Operations Marlo Burns identifies the man sent to kill them as Trevor Saropian and gives them his address. While in Denver A.M. realizes that his aliases have been blown and tells Langston that his planned arrival in New York will be delayed; meanwhile, Dixon deduces that the collection of figures discovered on the Franz USB represents days and months. Reacher, Neagley, Dixon, and O'Donnell pay a visit to Saropian's house, correctly anticipating an ambush and killing numerous mercenaries working for New Age. With New Age's involvement now confirmed, the team members raid the company's HQ, finding evidence that Swan had been an employee there.",
    "releaseDate": "2023-12-14",
    "episodeLength": 47,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0PXLZ655KJ5QWGNZQS7BZA1WR8/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ALAAAAAA0wr0?autoplay=1&t=2601"
  },
  {
    "season": 2,
    "episode": 4,
    "episodeName": "A Night at the Symphony",
    "primeSummary": "Reacher and his team head to Boston to track down a political aide with insider knowledge of a top secret military-defense contract that may be the reason behind their friends’ deaths.",
    "summary": "As the team members investigate their discoveries from New Age, they disagree on Swan's motives after discovering he works in the company's security department. The team members find out New Age has a government defense contract called Little Wing, thanks to notes from a senator named Lavoy. Meanwhile, back in Denver, A.M. kills a plastic surgeon in an attempt to steal his identity before flying to New York. The team members track the senator's legislative aide to Boston, where Dixon helps Reacher's old ally Oscar Finlay arrest the aide to coerce information out of him. The aide reveals to Reacher and O'Donnell that Little Wing is a surface-to-air missile program conducted in New Age facilities in Denver and New York to create missiles that will always hit their targets. Reacher realizes that people from New Age are planning to sell 650 missiles to A.M. to enable terrorist attacks. Later that night, the team are ambushed by a biker gang but subdue them. Reacher then phones Langston, who hired the gang and tries to bribe him into going away, but Reacher refuses and declares he wants to throw Langston out of a helicopter.",
    "releaseDate": "2023-12-21",
    "episodeLength": 46,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0LMPEPAIN6KAV627ICYT03Q10L/ref=atv_dp_btf_el_prime_uhd_tv_wfb_t1ALAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 2,
    "episode": 5,
    "episodeName": "Burial",
    "primeSummary": "Neagley and Dixon discover shocking information about an old friend in Denver while Reacher and O’Donnell learn more about the nefarious and mysterious A.M..",
    "summary": "Neagley and Dixon visit New Age's facility in Denver, hoping to see the missiles, but find they have been taken in a truck. One of A.M.'s henchmen, Oleg, stages the breakdown of another lorry on the first truck's route and kills its driver. He opens the truck's trailer, revealing three other henchmen and the missiles. Neagley and Dixon, who have been chasing the first truck, come upon the scene just after the henchmen have switched the trailers. Oleg drives off with the missiles before Neagley and Dixon kill the other three henchmen. In the paperwork the two received from New Age's Denver facility's manager, they learned that Swan had allowed the missiles to leave New Age. Meanwhile, Reacher and O'Donnell visit Washington D.C. and make a trip to the Department of Homeland Security for information on A.M. Senator Lavoy catches up with Reacher and offers his assistance in stopping a possible terrorist attack. The team members then head back to New York for Franz's funeral, where Reacher runs into and confronts Russo, who reveals that Langston is a former NYPD detective and the New Age security department, minus Swan, are also former cops from the same precinct who took early retirement after being investigated. During the funeral, two hitmen try to kill the team members. Neagley kills one of the snipers; Reacher and Russo chase and catch the other. He reveals that Swan paid him to kill the members of the team; when he goes to an abandoned building to collect his payment, the building explodes.",
    "releaseDate": "2023-12-28",
    "episodeLength": 43,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0U7SL8J80QIKLQ4ZFSTPB4V4V0/ref=atv_dp_btf_el_prime_uhd_tv_wfb_t1ALAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 2,
    "episode": 6,
    "episodeName": "New York's Finest",
    "primeSummary": "As the mystery continues to unfold, Reacher and his team set a trap to even the score.",
    "summary": "Following the building explosion, Russo gives the team a lead regarding the location of Marlo Burns. After the team track her down, she confirms that Swan has been trying to stop New Age's terrorist operation. She also reveals that she has been on the run thanks to Langston, who warned her that he would kill her and her daughter if she associated herself with Swan. Russo learns New Age contacted his boss, who is involved with their plans; Langston bribed him into revealing information regarding Reacher's team and updates on Russo's investigation. When Russo and Marlo's daughter Jane attempt to go into hiding, New Age hitmen track them and try to kill them in a high-speed chase across the city, forcing Russo to call the team for backup. The team enlists Marlo as bait to lure Langston and other members of New Age into a trap, which results in Reacher killing all of them minus Langston, who escapes in a helicopter. Afterwards, Neagley, Dixon, and O'Donnell arrive to assist Russo. They rescue Jane, but Russo has sacrificed himself to kill the hitmen.",
    "releaseDate": "2024-01-04",
    "episodeLength": 45,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0HC88FMQUHQUDIM8LX4EPB9BY0/ref=atv_dp_btf_el_prime_uhd_tv_wfb_t1ALAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 2,
    "episode": 7,
    "episodeName": "The Man Goes Through",
    "primeSummary": "As the team close in on Langston, two members of the 110th face danger, compelling Reacher to devise a dangerous plan to rescue them.",
    "summary": "Dixon and O'Donnell send Marlo and Jane to a safe place Dixon used to stay in Buffalo. Reacher and Neagley confront Lt. Marsh in his home; Reacher kills Marsh after he reveals that Grant, a hitman hired by Langston to take down Russo, is alive in a hospital. Reacher and Neagley extract information regarding the buy from Grant after Reacher threatens to burst the balloon in Grant's bladder by filling it with air. However, before leaving, Reacher ensures that Grant dies from an embolism as vengeance for killing Russo. They find a hitman disguised as a doctor sent to kill Grant, and the hitman accidentally dies in the subsequent fight. Langston reveals to Reacher in a phone call that he has got Dixon and O'Donnell. Reacher lies to Langston that Neagley got killed in the fight with the hitman; at the same time, Langston's men torture Dixon and O'Donnell. Reacher requests Lavoy's private security team for his mission. Leaving Neagley outside with a plan, Reacher walks into the New Age Facility alone and surrenders himself as he confronts Langston.",
    "releaseDate": "2024-01-11",
    "episodeLength": 45,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0GCMRAGKISOCQCJXJHF21YXBD4/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ALAAAAAA0wr0?autoplay=1&t=2431"
  },
  {
    "season": 2,
    "episode": 8,
    "episodeName": "Fly Boy",
    "primeSummary": "Reacher and Neagley make a final desperate attempt to save O’Donnell and Dixon, stop A.M. and avenge their friends’ murder.",
    "summary": "While held captive, Reacher learns that Swan never joined Langston and refused to be part of the conspiracy. As a result of his defiance, Langston murdered Swan and used his harvested iris and fingerprint to sign paperwork to frame him as the designated fall guy. Neagley and Lavoy's security team successfully break Reacher out of the New Age Facility, allowing him to board Langston's helicopter. Reacher kills the remaining bodyguard and, as promised, tosses Langston out of the chopper to his death, freeing O'Donnell and Dixon. The team then heads to the New Age engineer's house to ambush and kill A.M. Anticipating that Lavoy's security team will assassinate them as the last remaining loose ends, Reacher tipped off Homeland Security before his rescue mission, letting them arrest Lavoy and his security. The investigators kill the two remaining New Age employees for their part in the conspiracy by using a Little Wing missile on Langston's helicopter, with the crash covered up by Homeland Security. They distribute the $65 million among themselves and the surviving family members of their fallen allies, then go their separate ways.",
    "releaseDate": "2024-01-18",
    "episodeLength": 42,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0ISDZ42FO8FFYTA9K9LANUOAMK/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ALAAAAAA0wr0?autoplay=1&t=2253"
  },
  {
    "season": 3,
    "episode": 1,
    "episodeName": "Persuader",
    "primeSummary": "Reacher’s attempt to thwart a kidnapping brings him into contact with mysterious businessman Zachary Beck.",
    "summary": "In Maine, Reacher saves a young man from a kidnapping attempt by shooting the kidnapper. When Reacher accidentally shoots a cop, a police chase ensues. The man, whose name is Richard Beck, reveals to Reacher that someone had kidnapped him before and that his father only paid the ransom when his ear was amputated. Richard takes Reacher home to see his father, Zachary Beck. Reacher meets with Zachary, who thanks him for saving his son but is suspicious of him. Zachary offers Reacher a job if he plays Russian roulette, which he does. Reacher is working undercover for Susan Duffy, a DEA agent who recruited him to find a missing undercover agent, Teresa Daniels, in exchange for helping Reacher deal with a previous nemesis, Lieutenant Colonel Francis Xavier Quinn. To put Reacher undercover, they stage Richard's kidnapping, with the kidnapper and the cop being DEA agents (Steven Eliot and Guillermo Villanueva) working with Duffy. Reacher sneaks into the garage at night, where he finds and reveals to Duffy that Teresa was there.",
    "releaseDate": "2025-02-19",
    "episodeLength": 53,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0LZROH7DROBEQLY7YF6RV1OD1H/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ADAAAAAA0wr0?autoplay=1&t=0"
  },
  {
    "season": 3,
    "episode": 2,
    "episodeName": "Truckin'",
    "primeSummary": "Tasked with transporting cargo for his new employer Zachary Beck, Reacher must juggle the involvement of the DEA and a nosy new associate.",
    "summary": "When Duffy learns from Reacher that Teresa is in danger, she beats up the bodyguard they are holding captive to find out what they plan to do with Teresa, but the bodyguard claims he does not know. Reacher has a brief scuffle with hulking bodyguard Paulie before Zachary's head guard, Chapman Duke, sends Reacher to check out the hijacked cars. Reacher calls Duffy to tell her that it may be a problem for the kidnapping story; Duffy goes to the car yard to retrieve one of the cars. One of Zachary's associates, Angel Doll, notices the bodyguard's car but doesn't see Duffy change the license plate. Duke orders Reacher to take a truck to New London, Connecticut. Reacher calls Neagley to investigate the people he works with. Reacher meets with Duffy to check the trailer for drugs or Teresa's body, but they only find carpets. Back in Maine, Doll questions Reacher about his actions at the yard and in the kidnapping, and when Doll tries to tell Duke about his suspicions, Reacher slams his head onto a table, killing him.",
    "releaseDate": "2025-02-19",
    "episodeLength": 43,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0SANLQQ0UKA1YYON368EJT7NKQ/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ADAAAAAA0wr0?autoplay=1&t=2350"
  },
  {
    "season": 3,
    "episode": 3,
    "episodeName": "Number 2 with a Bullet",
    "primeSummary": "As a rising body count threatens his undercover position, Reacher makes a dangerous play to secure Beck’s trust.",
    "summary": "After returning from New London, Reacher meets with Zachary over a message from Doll. Reacher tries to make him believe that his partners are trying to betray him and that they should kill them, but Zachary doesn't listen. After this, Reacher tells Duffy that he has a car ready to go back to the warehouse where he killed Doll. When Reacher arrives at the meeting point, Duffy tells him she will go with him to find Teresa, to which Reacher reluctantly agrees. At the warehouse, Reacher and Duffy search for Teresa and clean up Doll's remains; two men arrive, and Reacher and Duffy kill them. Duffy keeps Doll's laptop. The next day, Reacher has to be with Richard in town. Reacher defends him from some thugs, and Richard tells him that Zachary's boss, Julius McCabe, threatened him and his father. When Reacher returns home, he goes with Duke and Zachary to a cabin, the kidnapper's hiding spot. Reacher takes the opportunity to kill Duke, fake a shootout and blow up the house; in the car, he wins over Zachary and becomes his number two.",
    "releaseDate": "2025-02-19",
    "episodeLength": 54,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0LM6EPXNGGTRZAEWAW7GM1RSR4/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ADAAAAAA0wr0?autoplay=1&t=3050"
  },
  {
    "season": 3,
    "episode": 4,
    "episodeName": "Dominique",
    "primeSummary": "Reacher reunites with Duffy and Villanueva and finally shares the painful details of his history with Xavier Quinn.",
    "summary": "Reacher heads to Duffy's house after gaining Zachary's trust. He discovers that Julius McCabe is Xavier Quinn, believed to be dead. Following the revelation, Reacher tells Duffy how he received a new partner, Dominique Kohl, to investigate a case involving Roland Gorowski. They eventually force Gorowski to inform them that he works for Quinn, selling state secrets because Quinn threatened his family. Reacher and Kohl, along with Anthony Frasconi, intercept one of Quinn's buyers, a Syrian businessman, Safwan Qasim, whom they force to assist in capturing Quinn. Having evidence to prosecute him, Reacher allows Kohl to arrest Quinn. Quinn instead kidnaps Kohl. In his search for her, Reacher finds Frasconi dead in a house and later finds Kohl's bloody body hanging in a cabin; Quinn brutally murdered her. Reacher finds Quinn and shoots him in retaliation, apparently killing him. Back in the present, Zachary sends Reacher to a factory where they have located Doll's laptop and where Duffy is. Reacher heads to the factory as three of Quinn's men arrive there.",
    "releaseDate": "2025-02-26",
    "episodeLength": 53,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0QQ626XDXKFHC755BMDAHRJR8W/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ADAAAAAA0wr0?autoplay=1&t=2939"
  },
  {
    "season": 3,
    "episode": 5,
    "episodeName": "Smackdown",
    "primeSummary": "When a DEA tragedy puts the entire mission at risk, Reacher, Duffy, and Villanueva improvise a drastic plan to save their cover.",
    "summary": "When Reacher can't contact Duffy, he calls Eliot to call the company's number. When Eliot calls, a gunfight breaks out between Quinn's men and Duffy and Villanueva; Reacher helps Duffy and Villanueva escape. At the cabin, the captive bodyguard manages to kill Eliot and escape. After discovering that the feds are spying on them, Quinn's men move into the house. When Duffy finds Eliot dead and the bodyguard has escaped, she calls Reacher to tell him so and get him out of the house, but Reacher formulates a plan involving Villanueva. Duffy cuts the power, and Reacher uses Villanueva as bait to kill the bodyguard. Back at the house, Zachary informs Reacher that Annette, the maid, was an ATF infiltrator and that Paulie has accidentally killed her. Reacher tells Duffy that several Feds are spying on them and that Quinn is dealing in firearms, not drugs. The following morning, Zachary informs Reacher that they must go to a factory. Reacher and Zachary arrive to meet Quinn.",
    "releaseDate": "2025-03-05",
    "episodeLength": 49,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0HDQP52KUSNU5B45RDFY8W2NV8/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ADAAAAAA0wr0?autoplay=1&t=2706"
  },
  {
    "season": 3,
    "episode": 6,
    "episodeName": "Smoke on the Water",
    "primeSummary": "Reacher is torn between his desire to kill Quinn and his promise to Duffy to save Teresa.",
    "summary": "Quinn meets with Zachary and accuses him of unknowingly having an ATF mole inside. Due to the retrograde amnesia caused by Reacher, Quinn has no memory of him and introduces himself to him using his alias McCabe. Quinn meets with a Russian mobster; Reacher discovers Quinn is in danger. Afterwards, Reacher drives into town with Richard to meet with Duffy and return her badge; Reacher and Duffy kiss, and Richard realizes that Reacher is a mole. Quinn sends men to kill everyone investigating him, including Neagley; Neagley kills them and tells Reacher. Quinn arrives at Zachary's house to question him about the U.S. Army investigating him; Zachary tells him that said unit was Reacher's. Quinn sends Paulie to kill Reacher, but he escapes, leading to a chase. Reacher kills all the men in the forest except Paulie and takes refuge in a laundromat. Quinn punishes Zachary by forcing Richard to play Russian roulette before having Paulie cut off Zachary's ear. Reacher and Duffy search for Teresa in Port Rome, but Harley, a member of Zachary's security team, claims that Quinn changed everything after Reacher escaped; they kill Harley, then travel to Los Angeles.",
    "releaseDate": "2025-03-12",
    "episodeLength": 48,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0HBV00UBMSYGBGOV9R2SRHQRMG/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ADAAAAAA0wr0?autoplay=1&t=2668"
  },
  {
    "season": 3,
    "episode": 7,
    "episodeName": "L.A. Story",
    "primeSummary": "After Reacher and Duffy travel to Los Angeles to arrange a deal, Neagley arrives in Maine to help Reacher get answers.",
    "summary": "Neagley interrogates Costopoulos, who tells her that Quinn murdered a family when business went wrong and is about to do the same to the Beck family. Reacher and Duffy, in Los Angeles, track down a drug dealer, Darien Prado, before having sex. Reacher and Duffy intercept Darien at a club and blackmail him into cooperating. He calls Zachary to meet, only for Reacher and Duffy to betray him. Zachary meets with Neagley, at Reacher's command, and tells her that he and his son are in danger. Quinn visits a captive Teresa. Reacher and the team discover that the weapons are being sold to Yemeni buyers and that a terrorist act will be carried out in the United States. Zachary apologizes to Richard for his wrongdoing and says he will protect him at all costs. Zachary informs Reacher of the time and place of the exchange. Duffy and Villanueva involve the ATF, much to Reacher's reluctance. On a call with Neagley, Reacher learns the exchange is actually taking place at Zachary's house, and the place they are at is a setup.",
    "releaseDate": "2025-03-19",
    "episodeLength": 52,
    "epsiodeLink": "https://www.amazon.com/gp/video/detail/0JUQSXJ0O0PGIGX6HVQWU80VT4/ref=atv_dp_btf_el_prime_uhd_tv_resume_t1ADAAAAAA0wr0?autoplay=1&t=2905"
  },
  {
    "season": 3,
    "episode": 8,
    "episodeName": "Unfinished Business",
    "primeSummary": "Available on Wednesday, March 26 9:00 PM",
    "summary": "TBA",
    "releaseDate": "2025-03-26",
    "episodeLength": "TBA",
    "epsiodeLink": "TBA"
  }
]